[
      {
            "Title": "Taiwanese PC Company MSI Falls Victim to Ransomware Attack",
            "Published": "Sat, 08 Apr 2023 20:07:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Taiwanese PC company MSI (short for Micro-Star International) officially confirmed it was the victim of a cyber attack on its systems.\nThe company said it \"promptly\" initiated incident response and recovery measures after detecting \"network anomalies.\" It also said it alerted law enforcement agencies of the matter.\nThat said, MSI did not disclose any specifics about when the attack took place",
            "Link": "https://thehackernews.com/2023/04/taiwanese-pc-company-msi-falls-victim.html"
      },
      {
            "Title": "Iran-Based Hackers Caught Carrying Out Destructive Attacks Under Ransomware Guise",
            "Published": "Sat, 08 Apr 2023 12:49:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "The Iranian nation-state group known as MuddyWater has been observed carrying out destructive attacks on hybrid environments under the guise of a ransomware operation.\nThat's according to new findings from the Microsoft Threat Intelligence team, which discovered the threat actor targeting both on-premises and cloud infrastructures in partnership with another emerging activity cluster dubbed",
            "Link": "https://thehackernews.com/2023/04/iran-based-hackers-caught-carrying-out.html"
      },
      {
            "Title": "Apple Releases Updates to Address Zero-Day Flaws in iOS, iPadOS, macOS, and Safari",
            "Published": "Sat, 08 Apr 2023 10:45:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Apple on Friday released security updates for iOS, iPadOS, macOS, and Safari web browser to address a pair of zero-day flaws that are being exploited in the wild.\nThe two vulnerabilities are as follows -\n\nCVE-2023-28205 - A use after free issue in WebKit that could lead to arbitrary code execution when processing specially crafted web content.\n\n\nCVE-2023-28206 - An out-of-bounds write issue in",
            "Link": "https://thehackernews.com/2023/04/apple-releases-updates-to-address-zero.html"
      },
      {
            "Title": "Expert-Led Webinar: Learn Proven Strategies to Secure Your Identity Perimeter",
            "Published": "Sat, 08 Apr 2023 10:35:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "The stakes are high when it comes to cybersecurity. No longer are we dealing with unskilled hackers trying to break into corporate systems with brute force. Today, cybercriminals are using highly sophisticated methods like social engineering, spear phishing, and BEC to target users directly and log in with valid credentials.\nThis is why the identity perimeter has become a critical battleground",
            "Link": "https://thehackernews.com/2023/03/thn-webinar-3-research-backed-ways-to.html"
      },
      {
            "Title": "Researchers Discover Critical Remote Code Execution Flaw in vm2 Sandbox Library",
            "Published": "Sat, 08 Apr 2023 10:34:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "The maintainers of the vm2 JavaScript sandbox module have shipped a patch to address a critical flaw that could be abused to break out of security boundaries and execute arbitrary shellcode.\nThe flaw, which affects all versions, including and prior to 3.9.14, was reported by researchers from South Korea-based KAIST WSP Lab on April 6, 2023, prompting vm2 to release a fix with version 3.9.15 on",
            "Link": "https://thehackernews.com/2023/04/researchers-discover-critical-remote.html"
      },
      {
            "Title": "Researchers Uncover Thriving Phishing Kit Market on Telegram Channels",
            "Published": "Fri, 07 Apr 2023 18:02:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "In yet another sign that Telegram is increasingly becoming a thriving hub for cybercrime, researchers have found that threat actors are using the messaging platform to peddle phishing kits and help set up phishing campaigns.\n\"To promote their 'goods,' phishers create Telegram channels through which they educate their audience about phishing and entertain subscribers with polls like, 'What type",
            "Link": "https://thehackernews.com/2023/04/researchers-uncover-thriving-phishing.html"
      },
      {
            "Title": "Microsoft Takes Legal Action to Disrupt Cybercriminals' Illegal Use of Cobalt Strike Tool",
            "Published": "Fri, 07 Apr 2023 11:45:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Microsoft said it teamed up with Fortra and Health Information Sharing and Analysis Center (Health-ISAC) to tackle the abuse of Cobalt Strike by cybercriminals to distribute malware, including ransomware.\nTo that end, the tech giant's Digital Crimes Unit (DCU) revealed that it secured a court order in the U.S. to \"remove illegal, legacy copies of Cobalt Strike so they can no longer be used by",
            "Link": "https://thehackernews.com/2023/04/microsoft-takes-legal-action-to-disrupt.html"
      },
      {
            "Title": "Are Source Code Leaks the New Threat Software vendors Should Care About?",
            "Published": "Fri, 07 Apr 2023 11:44:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Less than a month ago, Twitter indirectly acknowledged that some of its source code had been leaked on the code-sharing platform GitHub by sending a copyright infringement notice to take down the incriminated repository. The latter is now inaccessible, but according to the media, it was accessible to the public for several months. A user going by the name FreeSpeechEnthousiast committed",
            "Link": "https://thehackernews.com/2023/04/are-source-code-leaks-new-threat.html"
      },
      {
            "Title": "CISA Warns of Critical ICS Flaws in Hitachi, mySCADA, ICL, and Nexx Products",
            "Published": "Fri, 07 Apr 2023 11:29:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has published eight Industrial Control Systems (ICS) advisories warning of critical flaws affecting products from Hitachi Energy, mySCADA Technologies, Industrial Control Links, and Nexx.\nTopping the list is CVE-2022-3682 (CVSS score: 9.9), impacting Hitachi Energy's MicroSCADA System Data Manager SDM600 that could allow an",
            "Link": "https://thehackernews.com/2023/04/cisa-warns-of-critical-ics-flaws-in.html"
      },
      {
            "Title": "Supply Chain Attacks and Critical Infrastructure: How CISA Helps Secure a Nation's Crown Jewels",
            "Published": "Thu, 06 Apr 2023 17:16:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Critical infrastructure attacks are a preferred target for cyber criminals. Here's why and what's being done to protect them.\nWhat is Critical Infrastructure and Why is It Attacked?\nCritical infrastructure is the physical and digital assets, systems and networks that are vital to national security, the economy, public health, or safety. It can be government- or privately-owned.\nAccording to Etay",
            "Link": "https://thehackernews.com/2023/04/supply-chain-attacks-and-critical.html"
      },
      {
            "Title": "FBI Cracks Down on Genesis Market: 119 Arrested in Cybercrime Operation",
            "Published": "Thu, 06 Apr 2023 14:31:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "A joint international law enforcement operation has dismantled Genesis Market, an illegal online marketplace that specialized in the sale of stolen credentials associated with email, bank accounts, and social media platforms.\nCoinciding with the infrastructure seizure, the major crackdown, which involved authorities from 17 countries, culminated in 119 arrests and 208 property searches in 13",
            "Link": "https://thehackernews.com/2023/04/fbi-cracks-down-on-genesis-market-119.html"
      },
      {
            "Title": "Google Mandates Android Apps to Offer Easy Account Deletion In-App and Online",
            "Published": "Thu, 06 Apr 2023 09:10:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Google is enacting a new data deletion policy for Android apps that allow account creation to also offer users with a setting to delete their accounts in an attempt to provide more transparency and control over their data.\n\"For apps that enable app account creation, developers will soon need to provide an option to initiate account and data deletion from within the app and online,\" Bethel",
            "Link": "https://thehackernews.com/2023/04/google-mandates-android-apps-to-offer.html"
      },
      {
            "Title": "CryptoClippy: New Clipper Malware Targeting Portuguese Cryptocurrency Users",
            "Published": "Wed, 05 Apr 2023 19:47:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Portuguese users are being targeted by a new malware codenamed CryptoClippy that's capable of stealing cryptocurrency as part of a malvertising campaign.\nThe activity leverages SEO poisoning techniques to entice users searching for \"WhatsApp web\" to rogue domains hosting the malware, Palo Alto Networks Unit 42 said in a new report published today. \nCryptoClippy, a C-based executable, is a type",
            "Link": "https://thehackernews.com/2023/04/cryptoclippy-new-clipper-malware.html"
      },
      {
            "Title": "Hackers Using Self-Extracting Archives Exploit for Stealthy Backdoor Attacks",
            "Published": "Wed, 05 Apr 2023 18:06:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "An unknown threat actor used a malicious self-extracting archive (SFX) file in an attempt to establish persistent backdoor access to a victim's environment, new findings from CrowdStrike show.\nSFX files are capable of extracting the data contained within them without the need for dedicated software to display the file contents. It achieves this by including a decompressor stub, a piece of code",
            "Link": "https://thehackernews.com/2023/04/hackers-using-self-extracting-archives.html"
      },
      {
            "Title": "Google TAG Warns of North Korean-linked ARCHIPELAGO Cyberattacks",
            "Published": "Wed, 05 Apr 2023 17:49:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "A North Korean government-backed threat actor has been linked to attacks targeting government and military personnel, think tanks, policy makers, academics, and researchers in South Korea and the U.S.\nGoogle's Threat Analysis Group (TAG) is tracking the cluster under the name ARCHIPELAGO, which it said is a subset of another threat group tracked by Mandiant under the name APT43.\nThe tech giant",
            "Link": "https://thehackernews.com/2023/04/google-tag-warns-of-north-korean-linked.html"
      },
      {
            "Title": "Protect Your Company: Ransomware Prevention Made Easy",
            "Published": "Wed, 05 Apr 2023 17:19:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Every year hundreds of millions of malware attacks occur worldwide, and every year businesses deal with the impact of viruses, worms, keyloggers, and ransomware. Malware is a pernicious threat and the biggest driver for businesses to look for cybersecurity solutions. \nNaturally, businesses want to find products that will stop malware in its tracks, and so they search for solutions to do that.",
            "Link": "https://thehackernews.com/2023/04/protect-your-company-ransomware.html"
      },
      {
            "Title": "Typhon Reborn Stealer Malware Resurfaces with Advanced Evasion Techniques",
            "Published": "Wed, 05 Apr 2023 14:05:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "The threat actor behind the information-stealing malware known as Typhon Reborn has resurfaced with an updated version (V2) that packs in improved capabilities to evade detection and resist analysis.\nThe new version is offered for sale on the criminal underground for $59 per month, $360 per year, or alternatively, for $540 for a lifetime subscription.\n\"The stealer can harvest and exfiltrate",
            "Link": "https://thehackernews.com/2023/04/typhon-reborn-stealer-malware.html"
      },
      {
            "Title": "Sorting Through Haystacks to Find CTI Needles",
            "Published": "Tue, 04 Apr 2023 19:21:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Clouded vision\nCTI systems are confronted with some major issues ranging from the size of the collection networks to their diversity, which ultimately influence the degree of confidence they can put on their signals. Are they fresh enough and sufficiently reliable to avoid any false positives or any poisoning? Do I risk acting on outdated data? This difference is major since a piece of",
            "Link": "https://thehackernews.com/2023/04/sorting-through-haystacks-to-find-cti.html"
      },
      {
            "Title": "Rorschach Ransomware Emerges: Experts Warn of Advanced Evasion Strategies",
            "Published": "Tue, 04 Apr 2023 18:46:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Cybersecurity researchers have taken the wraps off a previously undocumented ransomware strain called Rorschach that's both sophisticated and fast.\n\"What makes Rorschach stand out from other ransomware strains is its high level of customization and its technically unique features that have not been seen before in ransomware,\" Check Point Research said in a new report. \"In fact, Rorschach is one",
            "Link": "https://thehackernews.com/2023/04/rorschach-ransomware-emerges-experts.html"
      },
      {
            "Title": "New Rilide Malware Targeting Chromium-Based Browsers to Steal Cryptocurrency",
            "Published": "Tue, 04 Apr 2023 18:37:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Chromium-based web browsers are the target of a new malware called Rilide that masquerades itself as a seemingly legitimate extension to harvest sensitive data and siphon cryptocurrency.\n\"Rilide malware is disguised as a legitimate Google Drive extension and enables threat actors to carry out a broad spectrum of malicious activities, including monitoring browsing history, taking screenshots, and",
            "Link": "https://thehackernews.com/2023/04/new-rilide-malware-targeting-chromium.html"
      },
      {
            "Title": "Arid Viper Hacking Group Using Upgraded Malware in Middle East Cyber Attacks",
            "Published": "Tue, 04 Apr 2023 15:38:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "The threat actor known as Arid Viper has been observed using refreshed variants of its malware toolkit in its attacks targeting Palestinian entities since September 2022.\nSymantec, which is tracking the group under its insect-themed moniker Mantis, said the adversary is \"going to great lengths to maintain a persistent presence on targeted networks.\"\nAlso known by the names APT-C-23 and Desert",
            "Link": "https://thehackernews.com/2023/04/arid-viper-hacking-group-using-upgraded.html"
      },
      {
            "Title": "Think Before You Share the Link: SaaS in the Real World",
            "Published": "Tue, 04 Apr 2023 15:24:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Collaboration sits at the essence of SaaS applications. The word, or some form of it, appears in the top two headlines on Google Workspace’s homepage. It can be found six times on Microsoft 365’s homepage, three times on Box, and once on Workday. Visit nearly any SaaS site, and odds are ‘collaboration’ will appear as part of the app’s key selling point. \nBy sitting on the cloud, content within",
            "Link": "https://thehackernews.com/2023/04/think-before-you-share-link-saas-in.html"
      },
      {
            "Title": "Microsoft Tightens OneNote Security by Auto-Blocking 120 Risky File Extensions",
            "Published": "Tue, 04 Apr 2023 10:00:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Microsoft has announced plans to automatically block embedded files with \"dangerous extensions\" in OneNote following reports that the note-taking service is being increasingly abused for malware delivery.\nUp until now, users were shown a dialog warning them that opening such attachments could harm their computer and data, but it was possible to dismiss the prompt and open the files.\nThat's going",
            "Link": "https://thehackernews.com/2023/04/microsoft-tightens-onenote-security-by.html"
      },
      {
            "Title": "Cryptocurrency Companies Targeted in Sophisticated 3CX Supply Chain Attack",
            "Published": "Tue, 04 Apr 2023 09:24:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "The adversary behind the supply chain attack targeting 3CX deployed a second-stage implant specifically singling out a small number of cryptocurrency companies.\nRussian cybersecurity firm Kaspersky, which has been internally tracking the versatile backdoor under the name Gopuram since 2020, said it observed an increase in the number of infections in March 2023 coinciding with the 3CX breach.",
            "Link": "https://thehackernews.com/2023/04/cryptocurrency-companies-targeted-in.html"
      },
      {
            "Title": "Western Digital Hit by Network Security Breach - Critical Services Disrupted!",
            "Published": "Mon, 03 Apr 2023 17:11:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Data storage devices maker Western Digital on Monday disclosed a \"network security incident\" that involved unauthorized access to its systems.\nThe breach is said to have occurred on March 26, 2023, enabling an unnamed third party to gain access to a \"number of the company's systems.\"\nFollowing the discovery of the hack, Western Digital said it has initiated incident response efforts and enlisted",
            "Link": "https://thehackernews.com/2023/04/western-digital-hit-by-network-security.html"
      },
      {
            "Title": "Italian Watchdog Bans OpenAI's ChatGPT Over Data Protection Concerns",
            "Published": "Mon, 03 Apr 2023 16:55:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "The Italian data protection watchdog, Garante per la Protezione dei Dati Personali (aka Garante), has imposed a temporary ban of OpenAI's ChatGPT service in the country, citing data protection concerns.\nTo that end, it has ordered the company to stop processing users' data with immediate effect, stating it intends to investigate the company over whether it's unlawfully processing such data in",
            "Link": "https://thehackernews.com/2023/04/italian-watchdog-bans-openais-chatgpt.html"
      },
      {
            "Title": "\"It's The Service Accounts, Stupid\": Why Do PAM Deployments Take (almost) Forever To Complete?",
            "Published": "Mon, 03 Apr 2023 16:50:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Privileged Access Management (PAM) solutions are regarded as the common practice to prevent identity threats to administrative accounts. In theory, the PAM concept makes absolute sense: place admin credentials in a vault, rotate their passwords, and closely monitor their sessions. However, the harsh reality is that the vast majority of PAM projects either become a years-long project, or even",
            "Link": "https://thehackernews.com/2023/04/its-service-accounts-stupid-why-do-pam.html"
      },
      {
            "Title": "Crypto-Stealing OpcJacker Malware Targets Users with Fake VPN Service",
            "Published": "Mon, 03 Apr 2023 14:50:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "A piece of new information-stealing malware called OpcJacker has been spotted in the wild since the second half of 2022 as part of a malvertising campaign. \n\"OpcJacker's main functions include keylogging, taking screenshots, stealing sensitive data from browsers, loading additional modules, and replacing cryptocurrency addresses in the clipboard for hijacking purposes,\" Trend Micro researchers",
            "Link": "https://thehackernews.com/2023/04/crypto-stealing-opcjacker-malware.html"
      },
      {
            "Title": "Microsoft Fixes New Azure AD Vulnerability Impacting Bing Search and Major Apps",
            "Published": "Sat, 01 Apr 2023 14:03:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Microsoft has patched a misconfiguration issue impacting the Azure Active Directory (AAD) identity and access management service that exposed several \"high-impact\" applications to unauthorized access.\n\"One of these apps is a content management system (CMS) that powers Bing.com and allowed us to not only modify search results, but also launch high-impact XSS attacks on Bing users,\" cloud security",
            "Link": "https://thehackernews.com/2023/04/microsoft-fixes-new-azure-ad.html"
      },
      {
            "Title": "Cacti, Realtek, and IBM Aspera Faspex Vulnerabilities Under Active Exploitation",
            "Published": "Sat, 01 Apr 2023 10:21:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Critical security flaws in Cacti, Realtek, and IBM Aspera Faspex are being exploited by various threat actors in hacks targeting unpatched systems.\nThis entails the abuse of CVE-2022-46169 (CVSS score: 9.8) and CVE-2021-35394 (CVSS score: 9.8) to deliver MooBot and ShellBot (aka PerlBot), Fortinet FortiGuard Labs said in a report published this week.\nCVE-2022-46169 relates to a critical",
            "Link": "https://thehackernews.com/2023/04/cacti-realtek-and-ibm-aspera-faspex.html"
      },
      {
            "Title": "Hackers Exploiting WordPress Elementor Pro Vulnerability: Millions of Sites at Risk!",
            "Published": "Sat, 01 Apr 2023 10:06:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Unknown threat actors are actively exploiting a recently patched security vulnerability in the Elementor Pro website builder plugin for WordPress.\nThe flaw, described as a case of broken access control, impacts versions 3.11.6 and earlier. It was addressed by the plugin maintainers in version 3.11.7 released on March 22.\n\"Improved code security enforcement in WooCommerce components,\" the Tel",
            "Link": "https://thehackernews.com/2023/04/hackers-exploiting-wordpress-elementor.html"
      },
      {
            "Title": "Winter Vivern APT Targets European Government Entities with Zimbra Vulnerability",
            "Published": "Fri, 31 Mar 2023 19:37:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "The advanced persistent threat (APT) actor known as Winter Vivern is now targeting officials in Europe and the U.S. as part of an ongoing cyber espionage campaign.\n\"TA473 since at least February 2023 has continuously leveraged an unpatched Zimbra vulnerability in publicly facing webmail portals that allows them to gain access to the email mailboxes of government entities in Europe,\" Proofpoint",
            "Link": "https://thehackernews.com/2023/03/winter-vivern-apt-targets-european.html"
      },
      {
            "Title": "Cyber Police of Ukraine Busted Phishing Gang Responsible for $4.33 Million Scam",
            "Published": "Fri, 31 Mar 2023 17:31:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "The Cyber Police of Ukraine, in collaboration with law enforcement officials from Czechia, has arrested several members of a cybercriminal gang that set up phishing sites to target European users.\nTwo of the apprehended affiliates are believed to be organizers, with 10 others detained in other territories across the European Union.\nThe suspects are alleged to have created more than 100 phishing",
            "Link": "https://thehackernews.com/2023/03/cyber-police-of-ukraine-busted-phishing.html"
      },
      {
            "Title": "Deep Dive Into 6 Key Steps to Accelerate Your Incident Response",
            "Published": "Fri, 31 Mar 2023 17:17:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Organizations rely on Incident response to ensure they are immediately aware of security incidents, allowing for quick action to minimize damage. They also aim to avoid follow on attacks or future related incidents.\nThe SANS Institute provides research and education on information security. In the upcoming webinar, we’ll outline, in detail, six components of a SANS incident response plan,",
            "Link": "https://thehackernews.com/2023/03/deep-dive-into-6-key-steps-to.html"
      },
      {
            "Title": "3CX Supply Chain Attack — Here's What We Know So Far",
            "Published": "Fri, 31 Mar 2023 15:07:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Enterprise communications software maker 3CX on Thursday confirmed that multiple versions of its desktop app for Windows and macOS are affected by a supply chain attack.\nThe version numbers include 18.12.407 and 18.12.416 for Windows and 18.11.1213, 18.12.402, 18.12.407, and 18.12.416 for macOS. The issue has been assigned the CVE identifier CVE-2023-29059.\nThe company said it's engaging the",
            "Link": "https://thehackernews.com/2023/03/3cx-supply-chain-attack-heres-what-we.html"
      },
      {
            "Title": "Researchers Detail Severe \"Super FabriXss\" Vulnerability in Microsoft Azure SFX",
            "Published": "Thu, 30 Mar 2023 22:32:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Details have emerged about a now-patched vulnerability in Azure Service Fabric Explorer (SFX) that could lead to unauthenticated remote code execution.\nTracked as CVE-2023-23383 (CVSS score: 8.2), the issue has been dubbed \"Super FabriXss\" by Orca Security, a nod to the FabriXss flaw (CVE-2022-35829, CVSS score: 6.2) that was fixed by Microsoft in October 2022.\n\"The Super FabriXss vulnerability",
            "Link": "https://thehackernews.com/2023/03/researchers-detail-severe-super.html"
      },
      {
            "Title": "Chinese RedGolf Group Targeting Windows and Linux Systems with KEYPLUG Backdoor",
            "Published": "Thu, 30 Mar 2023 21:28:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "A Chinese state-sponsored threat activity group tracked as RedGolf has been attributed to the use of a custom Windows and Linux backdoor called KEYPLUG.\n\"RedGolf is a particularly prolific Chinese state-sponsored threat actor group that has likely been active for many years against a wide range of industries globally,\" Recorded Future told The Hacker News.\n\"The group has shown the ability to",
            "Link": "https://thehackernews.com/2023/03/chinese-redgolf-group-targeting-windows.html"
      },
      {
            "Title": "New Wi-Fi Protocol Security Flaw Affecting Linux, Android and iOS Devices",
            "Published": "Thu, 30 Mar 2023 17:51:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "A group of academics from Northeastern University and KU Leuven has disclosed a fundamental design flaw in the IEEE 802.11 Wi-Fi protocol standard, impacting a wide range of devices running Linux, FreeBSD, Android, and iOS.\nSuccessful exploitation of the shortcoming could be abused to hijack TCP connections or intercept client and web traffic, researchers Domien Schepers, Aanjhan Ranganathan,",
            "Link": "https://thehackernews.com/2023/03/new-wi-fi-protocol-security-flaw.html"
      },
      {
            "Title": "Cyberstorage: Leveraging the Multi-Cloud to Combat Data Exfiltration",
            "Published": "Thu, 30 Mar 2023 16:47:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Multi-cloud data storage, once merely a byproduct of the great cloud migration, has now become a strategy for data management. \"Multi-cloud by design,\" and its companion the supercloud, is an ecosystem in which several cloud systems work together to provide many organizational benefits, including increased scale and overall resiliency.And now, even security teams who have long been the holdout",
            "Link": "https://thehackernews.com/2023/03/cyberstorage-leveraging-multi-cloud-to.html"
      },
      {
            "Title": "AlienFox Malware Targets API Keys and Secrets from AWS, Google, and Microsoft Cloud Services",
            "Published": "Thu, 30 Mar 2023 15:38:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "A new \"comprehensive toolset\" called AlienFox is being distributed on Telegram as a way for threat actors to harvest credentials from API keys and secrets from popular cloud service providers.\n\"The spread of AlienFox represents an unreported trend towards attacking more minimal cloud services, unsuitable for crypto mining, in order to enable and expand subsequent campaigns,\" SentinelOne security",
            "Link": "https://thehackernews.com/2023/03/alienfox-malware-targets-api-keys-and.html"
      },
      {
            "Title": "3CX Desktop App Supply Chain Attack Leaves Millions at Risk - Urgent Update on the Way!",
            "Published": "Thu, 30 Mar 2023 12:01:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "3CX said it's working on a software update for its desktop app after multiple cybersecurity vendors sounded the alarm on what appears to be an active supply chain attack that's using digitally signed and rigged installers of the popular voice and video conferencing software to target downstream customers.\n\"The trojanized 3CX desktop app is the first stage in a multi-stage attack chain that pulls",
            "Link": "https://thehackernews.com/2023/03/3cx-desktop-app-targeted-in-supply.html"
      },
      {
            "Title": "Spyware Vendors Caught Exploiting Zero-Day Vulnerabilities on Android and iOS Devices",
            "Published": "Wed, 29 Mar 2023 19:22:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "A number of zero-day vulnerabilities that were addressed last year were exploited by commercial spyware vendors to target Android and iOS devices, Google's Threat Analysis Group (TAG) has revealed.\nThe two distinct campaigns were both limited and highly targeted, taking advantage of the patch gap between the release of a fix and when it was actually deployed on the targeted devices. The scale of",
            "Link": "https://thehackernews.com/2023/03/spyware-vendors-caught-exploiting-zero.html"
      },
      {
            "Title": "Mélofée: Researchers Uncover New Linux Malware Linked to Chinese APT Groups",
            "Published": "Wed, 29 Mar 2023 17:31:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "An unknown Chinese state-sponsored hacking group has been linked to a novel piece of malware aimed at Linux servers.\nFrench cybersecurity firm ExaTrack, which found three samples of the previously documented malicious software that date back to early 2022, dubbed it Mélofée.\nThe newest of the three artifacts is designed to drop a kernel-mode rootkit that's based on an open source project",
            "Link": "https://thehackernews.com/2023/03/melofee-researchers-uncover-new-linux.html"
      },
      {
            "Title": "How to Build a Research Lab for Reverse Engineering — 4 Ways",
            "Published": "Wed, 29 Mar 2023 17:13:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Malware analysis is an essential part of security researcher's work. But working with malicious samples can be dangerous — it requires specialized tools to record their activity, and a secure environment to prevent unintended damage.\nHowever, manual lab setup and configuration can prove to be a laborious and time-consuming process.\nIn this article, we'll look at 4 ways to create a reverse",
            "Link": "https://thehackernews.com/2023/03/how-to-build-research-lab-for-reverse.html"
      },
      {
            "Title": "Smart Mobility has a Blindspot When it Comes to API Security",
            "Published": "Wed, 29 Mar 2023 17:13:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "The emergence of smart mobility services and applications has led to a sharp increase in the use of APIs in the automotive industry. However, this increased reliance on APIs has also made them one of the most common attack vectors. According to Gartner, APIs account for 90% of the web application attack surface areas. \nWith no surprise, similar trends are emerging also in the smart mobility",
            "Link": "https://thehackernews.com/2023/03/smart-mobility-has-blindspot-when-it.html"
      },
      {
            "Title": "Trojanized TOR Browser Installers Spreading Crypto-Stealing Clipper Malware",
            "Published": "Wed, 29 Mar 2023 14:47:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Trojanized installers for the TOR anonymity browser are being used to target users in Russia and Eastern Europe with clipper malware designed to siphon cryptocurrencies since September 2022.\n\"Clipboard injectors [...] can be silent for years, show no network activity or any other signs of presence until the disastrous day when they replace a crypto wallet address,\" Vitaly Kamluk, director of",
            "Link": "https://thehackernews.com/2023/03/trojanized-tor-browser-installers.html"
      },
      {
            "Title": "North Korean APT43 Group Uses Cybercrime to Fund Espionage Operations",
            "Published": "Wed, 29 Mar 2023 11:02:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "A new North Korean nation-state cyber operator has been attributed to a series of campaigns orchestrated to gather strategic intelligence that aligns with Pyongyang's geopolitical interests since 2018.\nGoogle-owned Mandiant, which is tracking the activity cluster under the moniker APT43, said the group's motives are both espionage- and financially-motivated, leveraging techniques like credential",
            "Link": "https://thehackernews.com/2023/03/north-korean-apt43-group-uses.html"
      },
      {
            "Title": "Microsoft Introduces GPT-4 AI-Powered Security Copilot Tool to Empower Defenders",
            "Published": "Tue, 28 Mar 2023 23:38:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Microsoft on Tuesday unveiled Security Copilot in limited preview, marking its continued quest to embed AI-oriented features in an attempt to offer \"end-to-end defense at machine speed and scale.\"\nPowered by OpenAI's GPT-4 generative AI and its own security-specific model, it's billed as a security analysis tool that enables cybersecurity analysts to quickly respond to threats, process signals,",
            "Link": "https://thehackernews.com/2023/03/microsoft-introduces-gpt-4-ai-powered.html"
      },
      {
            "Title": "Pakistan-Origin SideCopy Linked to New Cyberattack on India's Ministry of Defence",
            "Published": "Tue, 28 Mar 2023 18:01:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "An advanced persistent threat (APT) group that has a track record of targeting India and Afghanistan has been linked to a new phishing campaign that delivers Action RAT.\nAccording to Cyble, which attributed the operation to SideCopy, the activity cluster is designed to target the Defence Research and Development Organization (DRDO), the research and development wing of India's Ministry of",
            "Link": "https://thehackernews.com/2023/03/pakistan-origin-sidecopy-linked-to-new.html"
      },
      {
            "Title": "IcedID Malware Shifts Focus from Banking Fraud to Ransomware Delivery",
            "Published": "Tue, 28 Mar 2023 17:38:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Multiple threat actors have been observed using two new variants of the IcedID malware in the wild with more limited functionality that removes functionality related to online banking fraud.\nIcedID, also known as BokBot, started off as a banking trojan in 2017. It's also capable of delivering additional malware, including ransomware.\n\"The well-known IcedID version consists of an initial loader",
            "Link": "https://thehackernews.com/2023/03/icedid-malware-shifts-focus-from.html"
      },
      {
            "Title": "Estonian National Charged in U.S. for Acquiring Electronics and Metasploit Pro for Russian Military",
            "Published": "Mon, 10 Apr 2023 18:31:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "An Estonian national has been charged in the U.S. for purchasing U.S.-made electronics on behalf of the Russian government and military.\nThe 45-year-old individual, Andrey Shevlyakov, was arrested on March 28, 2023, in Tallinn. He has been indicted with 18 counts of conspiracy and other charges. If found guilty, he faces up to 20 years in prison.\nCourt documents allege that Shevlyakov operated",
            "Link": "https://thehackernews.com/2023/04/estonian-national-charged-in-us-for.html"
      },
      {
            "Title": "Hackers Flood NPM with Bogus Packages Causing a DoS Attack",
            "Published": "Mon, 10 Apr 2023 18:15:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Threat actors flooded the npm open source package repository for Node.js with bogus packages that briefly even resulted in a denial-of-service (DoS) attack.\n\"The threat actors create malicious websites and publish empty packages with links to those malicious websites, taking advantage of open-source ecosystems' good reputation on search engines,\" Checkmarx's Jossef Harush Kadouri said in a",
            "Link": "https://thehackernews.com/2023/04/hackers-flood-npm-with-bogus-packages.html"
      },
      {
            "Title": "Top 10 Cybersecurity Trends for 2023: From Zero Trust to Cyber Insurance",
            "Published": "Mon, 10 Apr 2023 17:08:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "As technology advances, cyberattacks are becoming more sophisticated. With the increasing use of technology in our daily lives, cybercrime is on the rise, as evidenced by the fact that cyberattacks caused 92% of all data breaches in the first quarter of 2022. Staying current with cybersecurity trends and laws is crucial to combat these threats, which can significantly impact business development",
            "Link": "https://thehackernews.com/2023/04/top-10-cybersecurity-trends-for-2023.html"
      },
      {
            "Title": "Over 1 Million WordPress Sites Infected by Balada Injector Malware Campaign",
            "Published": "Mon, 10 Apr 2023 15:46:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Over one million WordPress websites are estimated to have been infected by an ongoing campaign to deploy malware called Balada Injector since 2017.\nThe massive campaign, per GoDaddy's Sucuri, \"leverages all known and recently discovered theme and plugin vulnerabilities\" to breach WordPress sites. The attacks are known to play out in waves once every few weeks.\n\"This campaign is easily identified",
            "Link": "https://thehackernews.com/2023/04/over-1-million-wordpress-sites-infected.html"
      },
      {
            "Title": "Protecting your business with Wazuh: The open source security platform",
            "Published": "Mon, 10 Apr 2023 14:57:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "Today, businesses face a variety of security challenges like cyber attacks, compliance requirements, and endpoint security administration. The threat landscape constantly evolves, and it can be overwhelming for businesses to keep up with the latest security trends. Security teams use processes and security solutions to curb these challenges. These solutions include firewalls, antiviruses, data",
            "Link": "https://thehackernews.com/2023/04/protecting-your-business-with-wazuh.html"
      },
      {
            "Title": "CISA Warns of 5 Actively Exploited Security Flaws: Urgent Action Required",
            "Published": "Mon, 10 Apr 2023 11:55:00 +0530",
            "Author": "info@thehackernews.com (The Hacker News)",
            "Description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added five security flaws to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild.\nThis includes three high-severity flaws in the Veritas Backup Exec Agent software (CVE-2021-27876, CVE-2021-27877, and CVE-2021-27878) that could lead to the execution of privileged commands",
            "Link": "https://thehackernews.com/2023/04/cisa-warns-of-5-actively-exploited.html"
      }
]